<?php

declare(strict_types=1);

/**
 * @copyright   Copyright 2020, CitrusCalendar. All Rights Reserved.
 * @author      take64 <take64@citrus.tk>
 * @license     http://www.citrus.tk/
 */

namespace Citrus\Calendar\Holiday;

/**
 * 日本の暦
 */
class Japanese
{
    /** @var array [年][月][日] => 祝日名称 */
    public const HOLIDAYS = [
        2018 => [
            1 => [
                1 => '元日',
                8 => '成人の日',
            ],
            2 => [
                11 => '建国記念の日',
                12 => '振替休日',
            ],
            3 => [
                21 => '春分の日',
            ],
            4 => [
                29 => '昭和の日',
                30 => '振替休日',
            ],
            5 => [
                3 => '憲法記念日',
                4 => 'みどりの日',
                5 => 'こどもの日',
            ],
            6 => [

            ],
            7 => [
                16 => '海の日',
            ],
            8 => [
                11 => '山の日',
            ],
            9 => [
                17 => '敬老の日',
                23 => '秋分の日',
                24 => '振替休日',
            ],
            10 => [
                8 => '体育の日',
            ],
            11 => [
                3 => '文化の日',
                23 => '勤労感謝の日',
            ],
            12 => [
                23 => '天皇誕生日',
                24 => '振替休日',
            ],
        ],
        2019 => [
            1 => [
                1 => '元日',
                14 => '成人の日',
            ],
            2 => [
                11 => '建国記念の日',
            ],
            3 => [
                21 => '春分の日',
            ],
            4 => [
                29 => '昭和の日',
            ],
            5 => [
                3 => '憲法記念日',
                4 => 'みどりの日',
                5 => 'こどもの日',
                6 => '振替休日',
            ],
            6 => [
            ],
            7 => [
                15 => '海の日',
            ],
            8 => [
                11 => '山の日',
                12 => '振替休日',
            ],
            9 => [
                16 => '敬老の日',
                23 => '秋分の日',
            ],
            10 => [
                14 => '体育の日',
            ],
            11 => [
                3 => '文化の日',
                4 => '振替休日',
                23 => '勤労感謝の日',
            ],
            12 => [
            ],
        ],
        2020 => [
            1 => [
                1 => '元日',
                13 => '成人の日',
            ],
            2 => [
                11 => '建国記念の日',
                23 => '天皇誕生日',
                24 => '振替休日',
            ],
            3 => [
                20 => '春分の日',
            ],
            4 => [
                29 => '昭和の日',
            ],
            5 => [
                3 => '憲法記念日',
                4 => 'みどりの日',
                5 => 'こどもの日',
                6 => '振替休日',
            ],
            6 => [
            ],
            7 => [
                23 => '海の日',
                24 => 'スポーツの日',
            ],
            8 => [
                10 => '山の日',
            ],
            9 => [
                21 => '敬老の日',
                22 => '秋分の日',
            ],
            10 => [
            ],
            11 => [
                3 => '文化の日',
                23 => '勤労感謝の日',
            ],
            12 => [
            ],
        ],
        // 2021年は2020-04-12時点に設定したので後ほど精査の事
        2021 => [
            1 => [
                1 => '元日',
                11 => '成人の日',
            ],
            2 => [
                11 => '建国記念の日',
                23 => '天皇誕生日',
            ],
            3 => [
                20 => '春分の日',
            ],
            4 => [
                29 => '昭和の日',
            ],
            5 => [
                3 => '憲法記念日',
                4 => 'みどりの日',
                5 => 'こどもの日',
            ],
            6 => [
            ],
            7 => [
                19 => '海の日',
            ],
            8 => [
                11 => '山の日',
            ],
            9 => [
                20 => '敬老の日',
                23 => '秋分の日',
            ],
            10 => [
                11 => 'スポーツの日',
            ],
            11 => [
                3 => '文化の日',
                23 => '勤労感謝の日',
            ],
            12 => [
            ],
        ],
    ];



    /**
     * 祝日かどうか
     * (2018 - 2020)
     *
     * @param string $date 日付文字列
     * @return bool true:祝日,false:祝日ではない
     */
    public static function isHoliday(string $date): bool
    {
        $timestamp = strtotime($date);
        $year = date('Y', $timestamp);
        $month = date('n', $timestamp);
        $day = date('j', $timestamp);

        if (true === isset(self::HOLIDAYS[$year])
            && true === isset(self::HOLIDAYS[$year][$month])
            && true === isset(self::HOLIDAYS[$year][$month][$day]))
        {
            return true;
        }
        return false;
    }
}
